app/controllers/url_controller.rb

SELECT  `urls`.* FROM `urls` WHERE (index)  ORDER BY `urls`.`id` ASC LIMIT 1
---
	def show
		@url = Url.where(params[:id]).first

SELECT  `urls`.* FROM `urls` WHERE `urls`.`short` = 'ja8fti'  ORDER BY `urls`.`id` ASC LIMIT 1
---
	def index
		@url = Url.where(short: params[:id]).first